## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.allow-egress-googleapis will be created
+   resource "kubernetes_manifest" "allow-egress-googleapis" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "ServiceEntry"
+           metadata   = {
+               name      = "allow-egress-googleapis"
+               namespace = "cinema"
            }
+           spec       = {
+               hosts = [
+                   "accounts.google.com",
+                   "*.googleapis.com",
                ]
+               ports = [
+                   {
+                       name     = "http"
+                       number   = 80
+                       protocol = "HTTP"
                    },
+                   {
+                       name     = "https"
+                       number   = 443
+                       protocol = "HTTPS"
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "ServiceEntry"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "allow-egress-googleapis"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               addresses        = (known after apply)
+               endpoints        = (known after apply)
+               exportTo         = (known after apply)
+               hosts            = [
+                   "accounts.google.com",
+                   "*.googleapis.com",
                ]
+               location         = (known after apply)
+               ports            = [
+                   {
+                       name       = "http"
+                       number     = 80
+                       protocol   = "HTTP"
+                       targetPort = (known after apply)
                    },
+                   {
+                       name       = "https"
+                       number     = 443
+                       protocol   = "HTTPS"
+                       targetPort = (known after apply)
                    },
                ]
+               resolution       = (known after apply)
+               subjectAltNames  = (known after apply)
+               workloadSelector = {
+                   labels = (known after apply)
                }
            }
        }
    }

  # kubernetes_manifest.allow-egress-googlemetadata will be created
+   resource "kubernetes_manifest" "allow-egress-googlemetadata" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "ServiceEntry"
+           metadata   = {
+               name      = "allow-egress-google-metadata"
+               namespace = "cinema"
            }
+           spec       = {
+               addresses = [
+                   "169.254.169.254",
                ]
+               hosts     = [
+                   "metadata.google.internal",
                ]
+               ports     = [
+                   {
+                       name     = "http"
+                       number   = 80
+                       protocol = "HTTP"
                    },
+                   {
+                       name     = "https"
+                       number   = 443
+                       protocol = "HTTPS"
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "ServiceEntry"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "allow-egress-google-metadata"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               addresses        = [
+                   "169.254.169.254",
                ]
+               endpoints        = (known after apply)
+               exportTo         = (known after apply)
+               hosts            = [
+                   "metadata.google.internal",
                ]
+               location         = (known after apply)
+               ports            = [
+                   {
+                       name       = "http"
+                       number     = 80
+                       protocol   = "HTTP"
+                       targetPort = (known after apply)
                    },
+                   {
+                       name       = "https"
+                       number     = 443
+                       protocol   = "HTTPS"
+                       targetPort = (known after apply)
                    },
                ]
+               resolution       = (known after apply)
+               subjectAltNames  = (known after apply)
+               workloadSelector = {
+                   labels = (known after apply)
                }
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
